{"status": "publish", "title": "Healthy Traveling", "longitude": -106.44495, "content": "<p>In the past few days, the reality of this trip has really started to hit me. This ridiculous journey is supposed to last a year. A year! You lease an apartment for a year. I worked for my startup for a year. I'll celebrate a birthday, Christmas, and the Fourth of July in foreign countries. This is life now, not just traveling for a week or two.</p><p>So what? Well, I've got to take care of myself. Until staying in this hostel (Funky Monkey in Mazatlan), I cooked a handful of meals myself. It's hard to transport food on a motorcycle in a desert, and eating somewhere is absurdly easy. But tacos, enchiladas, and tostadas do not a balanced diet make, and joining Eder on a trip to the grocery store was a remarkable catalyst for change.</p><p>We went after a night of debauchery where I spent $8 USD at a taco stand. A veritable fortune of greasy food, and needless to say, my bowels were none too happy the next day. Following his lead, I picked up a wide assortment of fruits and vegetables, some local queso, eggs, bread, and yogurt. For less than $10 USD I had plenty of food for the next couple of days.</p><p>Thanks to 2 to 3 meals daily meals from Google, I hadn't really done any cooking for the last two years, and I was more than a little wary of diving of the assortment of foods and tools in front of me. Eder just dived right in, throwing oil, cactus, and potato in a pan while I tossed yogurt, ice, bananas, and mangoes into a blender. With some cheese, advocados, and tomatoes we suddenly had hearty, delicious sandwiches with refreshing smoothies on the side.</p><p>Rice, beans, spinach, peppers, avocados, tortillas, queso, cactus, eggs... mix and match and toss into a pot or pan and simple, healthy food magically appears. Who'd have thought how remarkably easy it is. I just had to get the ball rolling.</p><p><a href=\"http://brendanebers.com/wp-content/uploads/2015/07/mazatlan-eating-well.jpg\"><img class=\"alignnone size-full wp-image-263\" src=\"http://brendanebers.com/wp-content/uploads/2015/07/mazatlan-eating-well.jpg\" alt=\"Mazatlan - Eating Well\" width=\"2464\" height=\"1848\" /></a></p><p>So thank you, Eder, for unknowingly helping me get started.</p><p>But wait, there's more! When I was hanging out with Dan in Cabo, he took a daily break from the Sheraton infinity pool to hit the hotel gym. The gym? On vacation? But it got the old wheels turning, and I expressed some worry about fitness for the next year. I sit on a motorcycle, or in a hammock, or on the beach, or writing notes on my laptop. Sure, I might swim and walk a little, but it pales in comparison to the soccer, climbing, yoga, and hikes that were a large part of my life in San Francisco.</p><p>Russo brilliantly suggested body weight exercises with some brief cardio, and a few days ago he sent me an extremely detailed email. The next morning I woke up, grabbed my laptop and a couple straps from the motorcycle, then made for the sunlit roof.</p><p>Two episodes of Archer later, and I was amped up and ready to tackle anything (like my first surfing lesson). Fast forward two days and my entire body is still unnecessarily sore, and that's amazing. The workout took almost no space, left me feeling fantastic, and I only used a chair, a pillar, and straps. I can do this anywhere. Like cooking, I just needed some pointers to get the ball rolling.</p><p><a href=\"http://brendanebers.com/wp-content/uploads/2015/07/mazatlan-exercising.jpg\"><img class=\"alignnone size-full wp-image-262\" src=\"http://brendanebers.com/wp-content/uploads/2015/07/mazatlan-exercising.jpg\" alt=\"Mazatlan - Exercise\" width=\"2464\" height=\"1848\" /></a></p><p>Thank you too, Dan.</p><p>&nbsp;</p>", "post_id": 261, "epoch": 1436048345, "link": "http://brendanebers.com/2015/07/04/healthy-traveling/", "location": null, "latitude": 23.24846, "id": 17}
